Introduction To Dataframe

In [1]:
import numpy as numpy
import pandas as pd

In [2]:
df = pd.read_csv("weather_data.csv")
print(df)

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [3]:
weather_data = [('2024-01-01', 30,6, 'Sunny'),
                ('2024-01-02', 28,5, 'Cloudy'),
                ('2024-01-03', 25,4, 'Rainy'),
                ('2024-01-04', 32,7, 'Sunny'),
                ('2024-01-05', 27,3, 'Windy'),
                ('2024-01-06', 29,4, 'Rainy')
                ]
df = pd.DataFrame(weather_data, columns=['Date', 'Temperature', 'Windspeed', 'Condition'])
print(df)

         Date  Temperature  Windspeed Condition
0  2024-01-01           30          6     Sunny
1  2024-01-02           28          5    Cloudy
2  2024-01-03           25          4     Rainy
3  2024-01-04           32          7     Sunny
4  2024-01-05           27          3     Windy
5  2024-01-06           29          4     Rainy

In [4]:
df.columns

Index(['Date', 'Temperature', 'Windspeed', 'Condition'], dtype='object')

In [5]:
df[3::]

         Date  Temperature  Windspeed Condition
3  2024-01-04           32          7     Sunny
4  2024-01-05           27          3     Windy
5  2024-01-06           29          4     Rainy

In [6]:
df[['Date','Condition']]

         Date Condition
0  2024-01-01     Sunny
1  2024-01-02    Cloudy
2  2024-01-03     Rainy
3  2024-01-04     Sunny
4  2024-01-05     Windy
5  2024-01-06     Rainy

In [7]:
df[['Temperature','Windspeed']]

   Temperature  Windspeed
0           30          6
1           28          5
2           25          4
3           32          7
4           27          3
5           29          4

In [8]:
df.max()

Date           2024-01-06
Temperature            32
Windspeed               7
Condition           Windy
dtype: object

In [9]:
df['Temperature'].mean()

np.float64(28.5)

In [10]:
df['Temperature'].describe()

count     6.000000
mean     28.500000
std       2.428992
min      25.000000
25%      27.250000
50%      28.500000
75%      29.750000
max      32.000000
Name: Temperature, dtype: float64

In [11]:
df[df.Temperature == df.Temperature.max()]

         Date  Temperature  Windspeed Condition
3  2024-01-04           32          7     Sunny

In [12]:
df[df.Condition == 'Sunny']

         Date  Temperature  Windspeed Condition
0  2024-01-01           30          6     Sunny
3  2024-01-04           32          7     Sunny

Operations Of Pandas

In [13]:
%pip install xlrd
%pip install openpyxl

Requirement already satisfied: xlrd in c:\users\hp\appdata\local\programs\python\python313\lib\site-packages (2.0.2)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.2 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

Requirement already satisfied: openpyxl in c:\users\hp\appdata\local\programs\python\python313\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\hp\appdata\local\programs\python\python313\lib\site-packages (from openpyxl) (2.0.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.2 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [14]:
import pandas as pd
df = pd.read_excel("weather_data.xlsx")
print(df)

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [17]:
df.to_csv("new.csv")
df.to_csv("new_no_index.csv", index=False)
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [22]:
df.to_excel("new.xlsx",sheet_name="weather_data")
df.to_excel("new_no_index.xlsx", index=False)
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [25]:
df=pd.read_csv("weather_data_cities.csv")
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [26]:
p=df.groupby('city')
p

In [27]:
for city,city_df in p:
    print(city)
    print(city_df)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [31]:
#minimum
print(p.temperature.min())
#maximum
print(p.temperature.max())
#mean
print(p.temperature.mean())
#describe
print(p.temperature.describe())
for city,city_df in p:
    print(city)
    print(city_df)

city
mumbai      85
new york    28
paris       42
Name: temperature, dtype: int64
city
mumbai      92
new york    36
paris       54
Name: temperature, dtype: int64
city
mumbai      88.50
new york    32.25
paris       47.75
Name: temperature, dtype: float64
          count   mean       std   min    25%   50%    75%   max
city
mumbai      4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york    4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris       4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0
mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [30]:
p.get_group('new york')

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

In [33]:
import pandas as pd
india_weather = pd.DataFrame({
    "city": ["mumbai", "delhi", "bangalore"],
    "temperature": [32, 45, 30],
    "humidity": [80, 60, 78]
})
india_weather

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78

In [34]:
us_weather = pd.DataFrame({
    "city": ["new york", "chicago", "orlando"],
    "temperature": [21, 14, 35],
    "humidity": [68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [36]:
df=pd.concat([india_weather,us_weather])
df

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
0   new york           21        68
1    chicago           14        65
2    orlando           35        75

In [37]:
df=pd.concat([india_weather,us_weather],ignore_index=True)
df

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
3   new york           21        68
4    chicago           14        65
5    orlando           35        75

In [38]:
df=pd.concat([india_weather,us_weather],axis=1)
df

        city  temperature  humidity      city  temperature  humidity
0     mumbai           32        80  new york           21        68
1      delhi           45        60   chicago           14        65
2  bangalore           30        78   orlando           35        75

In [39]:
df=pd.concat([india_weather,us_weather],axis=0)
df

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
0   new york           21        68
1    chicago           14        65
2    orlando           35        75

In [40]:
temperature_df = pd.DataFrame({
    "city":["mumbai","delhi","bangalore","hyderabad"],
    "temperature":[32,45,30,33]
})
temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2  bangalore           30
3  hyderabad           33

In [41]:
humidity_df = pd.DataFrame({
    "city":["mumbai","delhi","hyderabad"],
    "humidity":[80,60,78,]
})
humidity_df

        city  humidity
0     mumbai        80
1      delhi        60
2  hyderabad        78

In [42]:
df=pd.merge(temperature_df,humidity_df,on="city")
df

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  hyderabad           33        78

In [43]:
df=pd.merge(temperature_df,humidity_df,on='city',how='outer')
df

        city  temperature  humidity
0  bangalore           30       NaN
1      delhi           45      60.0
2  hyderabad           33      78.0
3     mumbai           32      80.0

In [45]:
df=pd.DataFrame([1,2,3,4,5,6,7,8,9,10],index=[49,48,47,46,45,1,2,3,4,5])
df

     0
49   1
48   2
47   3
46   4
45   5
1    6
2    7
3    8
4    9
5   10

In [ ]:
df.loc[:2]  #label based indexing

    0
49  1
48  2
47  3
46  4
45  5
1   6
2   7

In [ ]:
df.iloc[:2]   #position based indexing

    0
49  1
48  2

In [50]:
df.loc[45]

0    5
Name: 45, dtype: int64